<a href="https://colab.research.google.com/github/shashwatshukla123/pro-134/blob/main/pro_134.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("star_with_gravity.csv")
df.head()

   Unnamed: 0       Star_name    Distance  Mass  Radius     Gravity
0           0             Sun    0.000016   1.0    1.00  274.269161
1           1          Sirius    8.600000   2.1    1.71  196.971800
2           2         Canopus  310.000000  15.0   71.00    0.816115
3           3  Alpha Centauri    4.400000   1.1    1.20  209.511165
4           4        Arcturus   37.000000   1.1   26.00    0.446296

In [ ]:
bools_distance = []
for distance in df.Distance:
    if distance <= 100:
        bools_distance.append(True)
    else:
        bools_distance.append(False)

In [ ]:
temp_distance = pd.Series(bools_distance)
temp_distance.head()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [ ]:
distance = df[temp_distance]

In [ ]:
distance.reset_index(inplace=True, drop=True)
distance.head()

   Unnamed: 0       Star_name   Distance  Mass  Radius     Gravity
0           0             Sun   0.000016   1.0    1.00  274.269161
1           1          Sirius   8.600000   2.1    1.71  196.971800
2           3  Alpha Centauri   4.400000   1.1    1.20  209.511165
3           4        Arcturus  37.000000   1.1   26.00    0.446296
4           5            Vega  25.000000   2.2    2.70   82.769843

In [ ]:
bools_gravity = []
for gravity in df.Gravity:
    if gravity <= 350 and gravity >= 150:
        bools_gravity.append(True)
    else:
        bools_gravity.append(False)

In [ ]:
gravity_support = pd.Series(bools_gravity)
gravity_support.head()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [ ]:
final_stars = df[gravity_support]
final_stars.head()

    Unnamed: 0       Star_name   Distance  Mass  Radius     Gravity
0            0             Sun   0.000016   1.0    1.00  274.269161
1            1          Sirius   8.600000   2.1    1.71  196.971800
3            3  Alpha Centauri   4.400000   1.1    1.20  209.511165
12          12          Altair  17.000000   1.8    1.80  152.371756
18          18       Fomalhaut  25.000000   1.9    1.80  160.836854

In [ ]:
final_stars.shape
final_stars.reset_index(inplace=True, drop=True)
final_stars.head()

   Unnamed: 0       Star_name   Distance  Mass  Radius     Gravity
0           0             Sun   0.000016   1.0    1.00  274.269161
1           1          Sirius   8.600000   2.1    1.71  196.971800
2           3  Alpha Centauri   4.400000   1.1    1.20  209.511165
3          12          Altair  17.000000   1.8    1.80  152.371756
4          18       Fomalhaut  25.000000   1.9    1.80  160.836854

In [ ]:
final_stars.to_csv("final_data.csv")